DangPhuGHup/STM32_Traffic_light/LAB_3/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2024 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f1xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define LED_TEST_Pin GPIO_PIN_1
#define LED_TEST_GPIO_Port GPIOA
#define GREEN_1_Pin GPIO_PIN_2
#define GREEN_1_GPIO_Port GPIOA
#define YELLOW_1_Pin GPIO_PIN_3
#define YELLOW_1_GPIO_Port GPIOA
#define RED_1_Pin GPIO_PIN_4
#define RED_1_GPIO_Port GPIOA
#define GREEN_2_Pin GPIO_PIN_5
#define GREEN_2_GPIO_Port GPIOA
#define YELLOW_2_Pin GPIO_PIN_6
#define YELLOW_2_GPIO_Port GPIOA
#define RED_2_Pin GPIO_PIN_7
#define RED_2_GPIO_Port GPIOA
#define SEG0_Pin GPIO_PIN_2
#define SEG0_GPIO_Port GPIOB
#define SEG11_Pin GPIO_PIN_10
#define SEG11_GPIO_Port GPIOB
#define SEG12_Pin GPIO_PIN_11
#define SEG12_GPIO_Port GPIOB
#define SEG13_Pin GPIO_PIN_12
#define SEG13_GPIO_Port GPIOB
#define SEG14_Pin GPIO_PIN_13
#define SEG14_GPIO_Port GPIOB
#define SEG15_Pin GPIO_PIN_14
#define SEG15_GPIO_Port GPIOB
#define SEG16_Pin GPIO_PIN_15
#define SEG16_GPIO_Port GPIOB
#define EN1_Pin GPIO_PIN_8
#define EN1_GPIO_Port GPIOA
#define EN2_Pin GPIO_PIN_9
#define EN2_GPIO_Port GPIOA
#define EN3_Pin GPIO_PIN_10
#define EN3_GPIO_Port GPIOA
#define EN4_Pin GPIO_PIN_11
#define EN4_GPIO_Port GPIOA
#define BUTTON_1_Pin GPIO_PIN_13
#define BUTTON_1_GPIO_Port GPIOA
#define BUTTON_2_Pin GPIO_PIN_14
#define BUTTON_2_GPIO_Port GPIOA
#define BUTTON_3_Pin GPIO_PIN_15
#define BUTTON_3_GPIO_Port GPIOA
#define SEG1_Pin GPIO_PIN_3
#define SEG1_GPIO_Port GPIOB
#define SEG2_Pin GPIO_PIN_4
#define SEG2_GPIO_Port GPIOB
#define SEG3_Pin GPIO_PIN_5
#define SEG3_GPIO_Port GPIOB
#define SEG4_Pin GPIO_PIN_6
#define SEG4_GPIO_Port GPIOB
#define SEG5_Pin GPIO_PIN_7
#define SEG5_GPIO_Port GPIOB
#define SEG6_Pin GPIO_PIN_8
#define SEG6_GPIO_Port GPIOB
#define SEG10_Pin GPIO_PIN_9
#define SEG10_GPIO_Port GPIOB

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
